## Текстовое описание решения задачи.
### Задача:
>Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

### Примеры:
>`["hello", "2", "world", ":-)"] -> ["2", ":-)"]`
>
>`["1234", "1567", "-2", "computer science"] -> ["-2"]`
>
>`["Russia", "Denmark", "Kazan"] -> []`

## Решение 
+ Оформим код программы с помощью методов.
+ Примем, что все символы для дальнейшей обработки вводит пользователь в консоль.

### Этап 1
Преобразуем строку введенную в консоль в массив строк с помощью встроенного метода `.Split`, маркером разделения введенной строки символов на элементы массива назначим "пробел".

Для выполнения этого этапа мы предварительно зададим условие ввода для пользователя при запуске программы например `введите символы через пробел` с помощью встроенного метода `Console.WriteLine()`.

Этап 1 выделим в метод.

### Этап 2
Для формирования нового массива строк из элементов с длиной меньше или равно 3 символа из ранее полученного необходимо заранее знать длину массива.

Для нахождения длины нового массива инициируем новую переменную `size` и `i`.

С помощью цикла for для переменной `i` не большей чем длина первого массива определим количество элементов `size` с длиной меньше или равно 3 символа сравнением каждого `i` элемента первого массива с максимальной длиной элемента нового массива, это и будет длиной нового массива.

Далее инициируем новый массив строк с размером `size`, новую переменную `j` и заново инициируем переменную `i`.

С помощью цикла for для переменной `i` не большей чем длина первого массива присвоим каждому `j` элементу нового массива значение `i` элемента первого массива, длина которого меньше или равно 3 символа. Причем важно чтобы инкремент `j` был сразу после присвоения значения.

Нахождение длины массива и формирование нового массива выделим в отдельный метод.

### Этап 3
Далее выведем в окно консоли первый и второй массивы так как нам дано в примерах, т.е. массив целиком в квадратных скобках `[]`, а каждый элемент массива в кавычках `""`.

Для этого напишем отдельный метод вывода элементов массива в одну строчку. C помощью цикла for для переменной `i` не большей чем длина текущего массива выводим каждый элемент встроенной функцией `Console.Write()` в кавычках с дополнительным условием вывода в консоль запятой после каждого `i` элемента кроме последнего.

### Конец.






